apache/nuttx/arch/arm/src/imxrt/hardware/imxrt_tmr.h
/********************************************************************************************************************************************
 * arch/arm/src/imxrt/hardware/imxrt_tmr.h
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ********************************************************************************************************************************************/

#ifndef __ARCH_ARM_SRC_IMXRT_HARDWARE_IMXRT_TMR_H
#define __ARCH_ARM_SRC_IMXRT_HARDWARE_IMXRT_TMR_H

/********************************************************************************************************************************************
 * Included Files
 ********************************************************************************************************************************************/

#include <nuttx/config.h>
#include "hardware/imxrt_memorymap.h"

/********************************************************************************************************************************************
 * Pre-processor Definitions
 ********************************************************************************************************************************************/

/* Register Offsets *************************************************************************************************************************/

#define IMXRT_TMR_COMP1_OFFSET               0x0000  /* Timer Channel Compare Register 1 */
#define IMXRT_TMR_COMP2_OFFSET               0x0002  /* Timer Channel Compare Register 2 */
#define IMXRT_TMR_CAPT_OFFSET                0x0004  /* Timer Channel Capture Register */
#define IMXRT_TMR_LOAD_OFFSET                0x0006  /* Timer Channel Load Register */
#define IMXRT_TMR_HOLD_OFFSET                0x0008  /* Timer Channel Hold Register */
#define IMXRT_TMR_CNTR_OFFSET                0x000a  /* Timer Channel Counter Register */
#define IMXRT_TMR_CTRL_OFFSET                0x000c  /* Timer Channel Control Register */
#define IMXRT_TMR_SCTRL_OFFSET               0x000e  /* Timer Channel Status and Control Register */
#define IMXRT_TMR_CMPLD1_OFFSET              0x0010  /* Timer Channel Comparator Load Register 1 */
#define IMXRT_TMR_CMPLD2_OFFSET              0x0012  /* Timer Channel Comparator Load Register 2 */
#define IMXRT_TMR_CSCTRL_OFFSET              0x0014  /* Timer Channel Comparator Status and Control Register */
#define IMXRT_TMR_FILT_OFFSET                0x0016  /* Timer Channel Input Filter Register */
#define IMXRT_TMR_DMA_OFFSET                 0x0018  /* Timer Channel DMA Enable Register */
#define IMXRT_TMR_ENBL_OFFSET                0x001e  /* Timer Channel Enable Register */

#define IMXRT_TMR_CHANNEL_SPACING            0x20    /* Each timer has 4 Channels spaced 0x20 apart */
#define IMXRT_TMR_CH0                        (0 * IMXRT_TMR_CHANNEL_SPACING)
#define IMXRT_TMR_CH1                        (1 * IMXRT_TMR_CHANNEL_SPACING)
#define IMXRT_TMR_CH2                        (2 * IMXRT_TMR_CHANNEL_SPACING)
#define IMXRT_TMR_CH3                        (3 * IMXRT_TMR_CHANNEL_SPACING)

#define IMXRT_TMR_OFFSET(ch,r)               ((r) + (ch))

#define IMXRT_TMR1_COMP10_OFFSET             IMXRT_TMR_OFFSET(IMXRT_TMR_CH0, IMXRT_TMR_COMP1_OFFSET)   /* Timer Channel Compare Register 1 */
#define IMXRT_TMR1_COMP20_OFFSET             IMXRT_TMR_OFFSET(IMXRT_TMR_CH0, IMXRT_TMR_COMP2_OFFSET)   /* Timer Channel Compare Register 2 */
#define IMXRT_TMR1_CAPT0_OFFSET              IMXRT_TMR_OFFSET(IMXRT_TMR_CH0, IMXRT_TMR_CAPT_OFFSET)    /* Timer Channel Capture Register */
#define IMXRT_TMR1_LOAD0_OFFSET              IMXRT_TMR_OFFSET(IMXRT_TMR_CH0, IMXRT_TMR_LOAD_OFFSET)    /* Timer Channel Load Register */
#define IMXRT_TMR1_HOLD0_OFFSET              IMXRT_TMR_OFFSET(IMXRT_TMR_CH0, IMXRT_TMR_HOLD_OFFSET)    /* Timer Channel Hold Register */
#define IMXRT_TMR1_CNTR0_OFFSET              IMXRT_TMR_OFFSET(IMXRT_TMR_CH0, IMXRT_TMR_CNTR_OFFSET)    /* Timer Channel Counter Register */
#define IMXRT_TMR1_CTRL0_OFFSET              IMXRT_TMR_OFFSET(IMXRT_TMR_CH0, IMXRT_TMR_CTRL_OFFSET)    /* Timer Channel Control Register */
#define IMXRT_TMR1_SCTRL0_OFFSET             IMXRT_TMR_OFFSET(IMXRT_TMR_CH0, IMXRT_TMR_SCTRL_OFFSET)   /* Timer Channel Status and Control Register */
#define IMXRT_TMR1_CMPLD10_OFFSET            IMXRT_TMR_OFFSET(IMXRT_TMR_CH0, IMXRT_TMR_CMPLD1_OFFSET)  /* Timer Channel Comparator Load Register 1 */
#define IMXRT_TMR1_CMPLD20_OFFSET            IMXRT_TMR_OFFSET(IMXRT_TMR_CH0, IMXRT_TMR_CMPLD2_OFFSET)  /* Timer Channel Comparator Load Register 2 */
#define IMXRT_TMR1_CSCTRL0_OFFSET            IMXRT_TMR_OFFSET(IMXRT_TMR_CH0, IMXRT_TMR_CSCTRL_OFFSET)  /* Timer Channel Comparator Status and Control Register */
#define IMXRT_TMR1_FILT0_OFFSET              IMXRT_TMR_OFFSET(IMXRT_TMR_CH0, IMXRT_TMR_FILT_OFFSET)    /* Timer Channel Input Filter Register */
#define IMXRT_TMR1_DMA0_OFFSET               IMXRT_TMR_OFFSET(IMXRT_TMR_CH0, IMXRT_TMR_DMA_OFFSET)     /* Timer Channel DMA Enable Register */
#define IMXRT_TMR1_ENBL_OFFSET               IMXRT_TMR_OFFSET(IMXRT_TMR_CH0, IMXRT_TMR_ENBL_OFFSET)    /* Timer Channel Enable Register */
#define IMXRT_TMR1_COMP11_OFFSET             IMXRT_TMR_OFFSET(IMXRT_TMR_CH1, IMXRT_TMR_COMP1_OFFSET)   /* Timer Channel Compare Register 1 */
#define IMXRT_TMR1_COMP21_OFFSET             IMXRT_TMR_OFFSET(IMXRT_TMR_CH1, IMXRT_TMR_COMP2_OFFSET)   /* Timer Channel Compare Register 2 */
#define IMXRT_TMR1_CAPT1_OFFSET              IMXRT_TMR_OFFSET(IMXRT_TMR_CH1, IMXRT_TMR_CAPT_OFFSET)    /* Timer Channel Capture Register */
#define IMXRT_TMR1_LOAD1_OFFSET              IMXRT_TMR_OFFSET(IMXRT_TMR_CH1, IMXRT_TMR_LOAD_OFFSET)    /* Timer Channel Load Register */
#define IMXRT_TMR1_HOLD1_OFFSET              IMXRT_TMR_OFFSET(IMXRT_TMR_CH1, IMXRT_TMR_HOLD_OFFSET)    /* Timer Channel Hold Register */
#define IMXRT_TMR1_CNTR1_OFFSET              IMXRT_TMR_OFFSET(IMXRT_TMR_CH1, IMXRT_TMR_CNTR_OFFSET)    /* Timer Channel Counter Register */
#define IMXRT_TMR1_CTRL1_OFFSET              IMXRT_TMR_OFFSET(IMXRT_TMR_CH1, IMXRT_TMR_CTRL_OFFSET)    /* Timer Channel Control Register */
#define IMXRT_TMR1_SCTRL1_OFFSET             IMXRT_TMR_OFFSET(IMXRT_TMR_CH1, IMXRT_TMR_SCTRL_OFFSET)   /* Timer Channel Status and Control Register */
#define IMXRT_TMR1_CMPLD11_OFFSET            IMXRT_TMR_OFFSET(IMXRT_TMR_CH1, IMXRT_TMR_CMPLD1_OFFSET)  /* Timer Channel Comparator Load Register 1 */
#define IMXRT_TMR1_CMPLD21_OFFSET            IMXRT_TMR_OFFSET(IMXRT_TMR_CH1, IMXRT_TMR_CMPLD2_OFFSET)  /* Timer Channel Comparator Load Register 2 */
#define IMXRT_TMR1_CSCTRL1_OFFSET            IMXRT_TMR_OFFSET(IMXRT_TMR_CH1, IMXRT_TMR_CSCTRL_OFFSET)  /* Timer Channel Comparator Status and Control Register */
#define IMXRT_TMR1_FILT1_OFFSET              IMXRT_TMR_OFFSET(IMXRT_TMR_CH1, IMXRT_TMR_FILT_OFFSET)    /* Timer Channel Input Filter Register */
#define IMXRT_TMR1_DMA1_OFFSET               IMXRT_TMR_OFFSET(IMXRT_TMR_CH1, IMXRT_TMR_DMA_OFFSET)     /* Timer Channel DMA Enable Register */
#define IMXRT_TMR1_COMP12_OFFSET             IMXRT_TMR_OFFSET(IMXRT_TMR_CH2, IMXRT_TMR_COMP1_OFFSET)   /* Timer Channel Compare Register 1 */
#define IMXRT_TMR1_COMP22_OFFSET             IMXRT_TMR_OFFSET(IMXRT_TMR_CH2, IMXRT_TMR_COMP2_OFFSET)   /* Timer Channel Compare Register 2 */
#define IMXRT_TMR1_CAPT2_OFFSET              IMXRT_TMR_OFFSET(IMXRT_TMR_CH2, IMXRT_TMR_CAPT_OFFSET)    /* Timer Channel Capture Register */
#define IMXRT_TMR1_LOAD2_OFFSET              IMXRT_TMR_OFFSET(IMXRT_TMR_CH2, IMXRT_TMR_LOAD_OFFSET)    /* Timer Channel Load Register */
#define IMXRT_TMR1_HOLD2_OFFSET              IMXRT_TMR_OFFSET(IMXRT_TMR_CH2, IMXRT_TMR_HOLD_OFFSET)    /* Timer Channel Hold Register */
#define IMXRT_TMR1_CNTR2_OFFSET              IMXRT_TMR_OFFSET(IMXRT_TMR_CH2, IMXRT_TMR_CNTR_OFFSET)    /* Timer Channel Counter Register */
#define IMXRT_TMR1_CTRL2_OFFSET              IMXRT_TMR_OFFSET(IMXRT_TMR_CH2, IMXRT_TMR_CTRL_OFFSET)    /* Timer Channel Control Register */
#define IMXRT_TMR1_SCTRL2_OFFSET             IMXRT_TMR_OFFSET(IMXRT_TMR_CH2, IMXRT_TMR_SCTRL_OFFSET)   /* Timer Channel Status and Control Register */
#define IMXRT_TMR1_CMPLD12_OFFSET            IMXRT_TMR_OFFSET(IMXRT_TMR_CH2, IMXRT_TMR_CMPLD1_OFFSET)  /* Timer Channel Comparator Load Register 1 */
#define IMXRT_TMR1_CMPLD22_OFFSET            IMXRT_TMR_OFFSET(IMXRT_TMR_CH2, IMXRT_TMR_CMPLD2_OFFSET)  /* Timer Channel Comparator Load Register 2 */
#define IMXRT_TMR1_CSCTRL2_OFFSET            IMXRT_TMR_OFFSET(IMXRT_TMR_CH2, IMXRT_TMR_CSCTRL_OFFSET)  /* Timer Channel Comparator Status and Control Register */
#define IMXRT_TMR1_FILT2_OFFSET              IMXRT_TMR_OFFSET(IMXRT_TMR_CH2, IMXRT_TMR_FILT_OFFSET)    /* Timer Channel Input Filter Register */
#define IMXRT_TMR1_DMA2_OFFSET               IMXRT_TMR_OFFSET(IMXRT_TMR_CH2, IMXRT_TMR_DMA_OFFSET)     /* Timer Channel DMA Enable Register */
#define IMXRT_TMR1_COMP13_OFFSET             IMXRT_TMR_OFFSET(IMXRT_TMR_CH3, IMXRT_TMR_COMP1_OFFSET)   /* Timer Channel Compare Register 1 */
#define IMXRT_TMR1_COMP23_OFFSET             IMXRT_TMR_OFFSET(IMXRT_TMR_CH3, IMXRT_TMR_COMP2_OFFSET)   /* Timer Channel Compare Register 2 */
#define IMXRT_TMR1_CAPT3_OFFSET              IMXRT_TMR_OFFSET(IMXRT_TMR_CH3, IMXRT_TMR_CAPT_OFFSET)    /* Timer Channel Capture Register */
#define IMXRT_TMR1_LOAD3_OFFSET              IMXRT_TMR_OFFSET(IMXRT_TMR_CH3, IMXRT_TMR_LOAD_OFFSET)    /* Timer Channel Load Register */
#define IMXRT_TMR1_HOLD3_OFFSET              IMXRT_TMR_OFFSET(IMXRT_TMR_CH3, IMXRT_TMR_HOLD_OFFSET)    /* Timer Channel Hold Register */
#define IMXRT_TMR1_CNTR3_OFFSET              IMXRT_TMR_OFFSET(IMXRT_TMR_CH3, IMXRT_TMR_CNTR_OFFSET)    /* Timer Channel Counter Register */
#define IMXRT_TMR1_CTRL3_OFFSET              IMXRT_TMR_OFFSET(IMXRT_TMR_CH3, IMXRT_TMR_CTRL_OFFSET)    /* Timer Channel Control Register */
#define IMXRT_TMR1_SCTRL3_OFFSET             IMXRT_TMR_OFFSET(IMXRT_TMR_CH3, IMXRT_TMR_SCTRL_OFFSET)   /* Timer Channel Status and Control Register */
#define IMXRT_TMR1_CMPLD13_OFFSET            IMXRT_TMR_OFFSET(IMXRT_TMR_CH3, IMXRT_TMR_CMPLD1_OFFSET)  /* Timer Channel Comparator Load Register 1 */
#define IMXRT_TMR1_CMPLD23_OFFSET            IMXRT_TMR_OFFSET(IMXRT_TMR_CH3, IMXRT_TMR_CMPLD2_OFFSET)  /* Timer Channel Comparator Load Register 2 */
#define IMXRT_TMR1_CSCTRL3_OFFSET            IMXRT_TMR_OFFSET(IMXRT_TMR_CH3, IMXRT_TMR_CSCTRL_OFFSET)  /* Timer Channel Comparator Status and Control Register */
#define IMXRT_TMR1_FILT3_OFFSET              IMXRT_TMR_OFFSET(IMXRT_TMR_CH3, IMXRT_TMR_FILT_OFFSET)    /* Timer Channel Input Filter Register */
#define IMXRT_TMR1_DMA3_OFFSET               IMXRT_TMR_OFFSET(IMXRT_TMR_CH3, IMXRT_TMR_DMA_OFFSET)     /* Timer Channel DMA Enable Register */

/* Timer 2 offset */

