apache/nuttx/arch/arm/src/imxrt/hardware/imxrt_tmr.h
/* Timer 4 offset */

#define IMXRT_TMR4_COMP10_OFFSET             IMXRT_TMR_OFFSET(IMXRT_TMR_CH0, IMXRT_TMR_COMP1_OFFSET)   /* Timer Channel Compare Register 1 */
#define IMXRT_TMR4_COMP20_OFFSET             IMXRT_TMR_OFFSET(IMXRT_TMR_CH0, IMXRT_TMR_COMP2_OFFSET)   /* Timer Channel Compare Register 2 */
#define IMXRT_TMR4_CAPT0_OFFSET              IMXRT_TMR_OFFSET(IMXRT_TMR_CH0, IMXRT_TMR_CAPT_OFFSET)    /* Timer Channel Capture Register */
#define IMXRT_TMR4_LOAD0_OFFSET              IMXRT_TMR_OFFSET(IMXRT_TMR_CH0, IMXRT_TMR_LOAD_OFFSET)    /* Timer Channel Load Register */
#define IMXRT_TMR4_HOLD0_OFFSET              IMXRT_TMR_OFFSET(IMXRT_TMR_CH0, IMXRT_TMR_HOLD_OFFSET)    /* Timer Channel Hold Register */
#define IMXRT_TMR4_CNTR0_OFFSET              IMXRT_TMR_OFFSET(IMXRT_TMR_CH0, IMXRT_TMR_CNTR_OFFSET)    /* Timer Channel Counter Register */
#define IMXRT_TMR4_CTRL0_OFFSET              IMXRT_TMR_OFFSET(IMXRT_TMR_CH0, IMXRT_TMR_CTRL_OFFSET)    /* Timer Channel Control Register */
#define IMXRT_TMR4_SCTRL0_OFFSET             IMXRT_TMR_OFFSET(IMXRT_TMR_CH0, IMXRT_TMR_SCTRL_OFFSET)   /* Timer Channel Status and Control Register */
#define IMXRT_TMR4_CMPLD10_OFFSET            IMXRT_TMR_OFFSET(IMXRT_TMR_CH0, IMXRT_TMR_CMPLD1_OFFSET)  /* Timer Channel Comparator Load Register 1 */
#define IMXRT_TMR4_CMPLD20_OFFSET            IMXRT_TMR_OFFSET(IMXRT_TMR_CH0, IMXRT_TMR_CMPLD2_OFFSET)  /* Timer Channel Comparator Load Register 2 */
#define IMXRT_TMR4_CSCTRL0_OFFSET            IMXRT_TMR_OFFSET(IMXRT_TMR_CH0, IMXRT_TMR_CSCTRL_OFFSET)  /* Timer Channel Comparator Status and Control Register */
#define IMXRT_TMR4_FILT0_OFFSET              IMXRT_TMR_OFFSET(IMXRT_TMR_CH0, IMXRT_TMR_FILT_OFFSET)    /* Timer Channel Input Filter Register */
#define IMXRT_TMR4_DMA0_OFFSET               IMXRT_TMR_OFFSET(IMXRT_TMR_CH0, IMXRT_TMR_DMA_OFFSET)     /* Timer Channel DMA Enable Register */
#define IMXRT_TMR4_ENBL_OFFSET               IMXRT_TMR_OFFSET(IMXRT_TMR_CH0, IMXRT_TMR_ENBL_OFFSET)    /* Timer Channel Enable Register */
#define IMXRT_TMR4_COMP11_OFFSET             IMXRT_TMR_OFFSET(IMXRT_TMR_CH1, IMXRT_TMR_COMP1_OFFSET)   /* Timer Channel Compare Register 1 */
#define IMXRT_TMR4_COMP21_OFFSET             IMXRT_TMR_OFFSET(IMXRT_TMR_CH1, IMXRT_TMR_COMP2_OFFSET)   /* Timer Channel Compare Register 2 */
#define IMXRT_TMR4_CAPT1_OFFSET              IMXRT_TMR_OFFSET(IMXRT_TMR_CH1, IMXRT_TMR_CAPT_OFFSET)    /* Timer Channel Capture Register */
#define IMXRT_TMR4_LOAD1_OFFSET              IMXRT_TMR_OFFSET(IMXRT_TMR_CH1, IMXRT_TMR_LOAD_OFFSET)    /* Timer Channel Load Register */
#define IMXRT_TMR4_HOLD1_OFFSET              IMXRT_TMR_OFFSET(IMXRT_TMR_CH1, IMXRT_TMR_HOLD_OFFSET)    /* Timer Channel Hold Register */
#define IMXRT_TMR4_CNTR1_OFFSET              IMXRT_TMR_OFFSET(IMXRT_TMR_CH1, IMXRT_TMR_CNTR_OFFSET)    /* Timer Channel Counter Register */
#define IMXRT_TMR4_CTRL1_OFFSET              IMXRT_TMR_OFFSET(IMXRT_TMR_CH1, IMXRT_TMR_CTRL_OFFSET)    /* Timer Channel Control Register */
#define IMXRT_TMR4_SCTRL1_OFFSET             IMXRT_TMR_OFFSET(IMXRT_TMR_CH1, IMXRT_TMR_SCTRL_OFFSET)   /* Timer Channel Status and Control Register */
#define IMXRT_TMR4_CMPLD11_OFFSET            IMXRT_TMR_OFFSET(IMXRT_TMR_CH1, IMXRT_TMR_CMPLD1_OFFSET)  /* Timer Channel Comparator Load Register 1 */
#define IMXRT_TMR4_CMPLD21_OFFSET            IMXRT_TMR_OFFSET(IMXRT_TMR_CH1, IMXRT_TMR_CMPLD2_OFFSET)  /* Timer Channel Comparator Load Register 2 */
#define IMXRT_TMR4_CSCTRL1_OFFSET            IMXRT_TMR_OFFSET(IMXRT_TMR_CH1, IMXRT_TMR_CSCTRL_OFFSET)  /* Timer Channel Comparator Status and Control Register */
#define IMXRT_TMR4_FILT1_OFFSET              IMXRT_TMR_OFFSET(IMXRT_TMR_CH1, IMXRT_TMR_FILT_OFFSET)    /* Timer Channel Input Filter Register */
#define IMXRT_TMR4_DMA1_OFFSET               IMXRT_TMR_OFFSET(IMXRT_TMR_CH1, IMXRT_TMR_DMA_OFFSET)     /* Timer Channel DMA Enable Register */
#define IMXRT_TMR4_COMP12_OFFSET             IMXRT_TMR_OFFSET(IMXRT_TMR_CH2, IMXRT_TMR_COMP1_OFFSET)   /* Timer Channel Compare Register 1 */
#define IMXRT_TMR4_COMP22_OFFSET             IMXRT_TMR_OFFSET(IMXRT_TMR_CH2, IMXRT_TMR_COMP2_OFFSET)   /* Timer Channel Compare Register 2 */
#define IMXRT_TMR4_CAPT2_OFFSET              IMXRT_TMR_OFFSET(IMXRT_TMR_CH2, IMXRT_TMR_CAPT_OFFSET)    /* Timer Channel Capture Register */
#define IMXRT_TMR4_LOAD2_OFFSET              IMXRT_TMR_OFFSET(IMXRT_TMR_CH2, IMXRT_TMR_LOAD_OFFSET)    /* Timer Channel Load Register */
#define IMXRT_TMR4_HOLD2_OFFSET              IMXRT_TMR_OFFSET(IMXRT_TMR_CH2, IMXRT_TMR_HOLD_OFFSET)    /* Timer Channel Hold Register */
#define IMXRT_TMR4_CNTR2_OFFSET              IMXRT_TMR_OFFSET(IMXRT_TMR_CH2, IMXRT_TMR_CNTR_OFFSET)    /* Timer Channel Counter Register */
#define IMXRT_TMR4_CTRL2_OFFSET              IMXRT_TMR_OFFSET(IMXRT_TMR_CH2, IMXRT_TMR_CTRL_OFFSET)    /* Timer Channel Control Register */
#define IMXRT_TMR4_SCTRL2_OFFSET             IMXRT_TMR_OFFSET(IMXRT_TMR_CH2, IMXRT_TMR_SCTRL_OFFSET)   /* Timer Channel Status and Control Register */
#define IMXRT_TMR4_CMPLD12_OFFSET            IMXRT_TMR_OFFSET(IMXRT_TMR_CH2, IMXRT_TMR_CMPLD1_OFFSET)  /* Timer Channel Comparator Load Register 1 */
#define IMXRT_TMR4_CMPLD22_OFFSET            IMXRT_TMR_OFFSET(IMXRT_TMR_CH2, IMXRT_TMR_CMPLD2_OFFSET)  /* Timer Channel Comparator Load Register 2 */
#define IMXRT_TMR4_CSCTRL2_OFFSET            IMXRT_TMR_OFFSET(IMXRT_TMR_CH2, IMXRT_TMR_CSCTRL_OFFSET)  /* Timer Channel Comparator Status and Control Register */
#define IMXRT_TMR4_FILT2_OFFSET              IMXRT_TMR_OFFSET(IMXRT_TMR_CH2, IMXRT_TMR_FILT_OFFSET)    /* Timer Channel Input Filter Register */
#define IMXRT_TMR4_DMA2_OFFSET               IMXRT_TMR_OFFSET(IMXRT_TMR_CH2, IMXRT_TMR_DMA_OFFSET)     /* Timer Channel DMA Enable Register */
#define IMXRT_TMR4_COMP13_OFFSET             IMXRT_TMR_OFFSET(IMXRT_TMR_CH3, IMXRT_TMR_COMP1_OFFSET)   /* Timer Channel Compare Register 1 */
#define IMXRT_TMR4_COMP23_OFFSET             IMXRT_TMR_OFFSET(IMXRT_TMR_CH3, IMXRT_TMR_COMP2_OFFSET)   /* Timer Channel Compare Register 2 */
#define IMXRT_TMR4_CAPT3_OFFSET              IMXRT_TMR_OFFSET(IMXRT_TMR_CH3, IMXRT_TMR_CAPT_OFFSET)    /* Timer Channel Capture Register */
#define IMXRT_TMR4_LOAD3_OFFSET              IMXRT_TMR_OFFSET(IMXRT_TMR_CH3, IMXRT_TMR_LOAD_OFFSET)    /* Timer Channel Load Register */
#define IMXRT_TMR4_HOLD3_OFFSET              IMXRT_TMR_OFFSET(IMXRT_TMR_CH3, IMXRT_TMR_HOLD_OFFSET)    /* Timer Channel Hold Register */
#define IMXRT_TMR4_CNTR3_OFFSET              IMXRT_TMR_OFFSET(IMXRT_TMR_CH3, IMXRT_TMR_CNTR_OFFSET)    /* Timer Channel Counter Register */
#define IMXRT_TMR4_CTRL3_OFFSET              IMXRT_TMR_OFFSET(IMXRT_TMR_CH3, IMXRT_TMR_CTRL_OFFSET)    /* Timer Channel Control Register */
#define IMXRT_TMR4_SCTRL3_OFFSET             IMXRT_TMR_OFFSET(IMXRT_TMR_CH3, IMXRT_TMR_SCTRL_OFFSET)   /* Timer Channel Status and Control Register */
#define IMXRT_TMR4_CMPLD13_OFFSET            IMXRT_TMR_OFFSET(IMXRT_TMR_CH3, IMXRT_TMR_CMPLD1_OFFSET)  /* Timer Channel Comparator Load Register 1 */
#define IMXRT_TMR4_CMPLD23_OFFSET            IMXRT_TMR_OFFSET(IMXRT_TMR_CH3, IMXRT_TMR_CMPLD2_OFFSET)  /* Timer Channel Comparator Load Register 2 */
#define IMXRT_TMR4_CSCTRL3_OFFSET            IMXRT_TMR_OFFSET(IMXRT_TMR_CH3, IMXRT_TMR_CSCTRL_OFFSET)  /* Timer Channel Comparator Status and Control Register */
#define IMXRT_TMR4_FILT3_OFFSET              IMXRT_TMR_OFFSET(IMXRT_TMR_CH3, IMXRT_TMR_FILT_OFFSET)    /* Timer Channel Input Filter Register */
#define IMXRT_TMR4_DMA3_OFFSET               IMXRT_TMR_OFFSET(IMXRT_TMR_CH3, IMXRT_TMR_DMA_OFFSET)     /* Timer Channel DMA Enable Register */

/* Register addresses *******************************************************************************************************************************/

