apache/nuttx/arch/arm/src/imxrt/hardware/imxrt_tmr.h
#define IMXRT_TMR1_COMP10                   (IMXRT_QTIMER1_BASE + IMXRT_TMR1_COMP10_OFFSET)   /* Timer Channel Compare Register 1 */
#define IMXRT_TMR1_COMP20                   (IMXRT_QTIMER1_BASE + IMXRT_TMR1_COMP20_OFFSET)   /* Timer Channel Compare Register 2 */
#define IMXRT_TMR1_CAPT0                    (IMXRT_QTIMER1_BASE + IMXRT_TMR1_CAPT0_OFFSET)    /* Timer Channel Capture Register */
#define IMXRT_TMR1_LOAD0                    (IMXRT_QTIMER1_BASE + IMXRT_TMR1_LOAD0_OFFSET)    /* Timer Channel Load Register */
#define IMXRT_TMR1_HOLD0                    (IMXRT_QTIMER1_BASE + IMXRT_TMR1_HOLD0_OFFSET)    /* Timer Channel Hold Register */
#define IMXRT_TMR1_CNTR0                    (IMXRT_QTIMER1_BASE + IMXRT_TMR1_CNTR0_OFFSET)    /* Timer Channel Counter Register */
#define IMXRT_TMR1_CTRL0                    (IMXRT_QTIMER1_BASE + IMXRT_TMR1_CTRL0_OFFSET)    /* Timer Channel Control Register */
#define IMXRT_TMR1_SCTRL0                   (IMXRT_QTIMER1_BASE + IMXRT_TMR1_SCTRL0_OFFSET)   /* Timer Channel Status and Control Register */
#define IMXRT_TMR1_CMPLD10                  (IMXRT_QTIMER1_BASE + IMXRT_TMR1_CMPLD10_OFFSET)  /* Timer Channel Comparator Load Register 1 */
#define IMXRT_TMR1_CMPLD20                  (IMXRT_QTIMER1_BASE + IMXRT_TMR1_CMPLD20_OFFSET)  /* Timer Channel Comparator Load Register 2 */
#define IMXRT_TMR1_CSCTRL0                  (IMXRT_QTIMER1_BASE + IMXRT_TMR1_CSCTRL0_OFFSET)  /* Timer Channel Comparator Status and Control Register */
#define IMXRT_TMR1_FILT0                    (IMXRT_QTIMER1_BASE + IMXRT_TMR1_FILT0_OFFSET)    /* Timer Channel Input Filter Register */
#define IMXRT_TMR1_DMA0                     (IMXRT_QTIMER1_BASE + IMXRT_TMR1_DMA0_OFFSET)     /* Timer Channel DMA Enable Register */
#define IMXRT_TMR1_ENBL                     (IMXRT_QTIMER1_BASE + IMXRT_TMR1_ENBL_OFFSET)     /* Timer Channel Enable Register */
#define IMXRT_TMR1_COMP11                   (IMXRT_QTIMER1_BASE + IMXRT_TMR1_COMP11_OFFSET)   /* Timer Channel Compare Register 1 */
#define IMXRT_TMR1_COMP21                   (IMXRT_QTIMER1_BASE + IMXRT_TMR1_COMP21_OFFSET)   /* Timer Channel Compare Register 2 */
#define IMXRT_TMR1_CAPT1                    (IMXRT_QTIMER1_BASE + IMXRT_TMR1_CAPT1_OFFSET)    /* Timer Channel Capture Register */
#define IMXRT_TMR1_LOAD1                    (IMXRT_QTIMER1_BASE + IMXRT_TMR1_LOAD1_OFFSET)    /* Timer Channel Load Register */
#define IMXRT_TMR1_HOLD1                    (IMXRT_QTIMER1_BASE + IMXRT_TMR1_HOLD1_OFFSET)    /* Timer Channel Hold Register */
#define IMXRT_TMR1_CNTR1                    (IMXRT_QTIMER1_BASE + IMXRT_TMR1_CNTR1_OFFSET)    /* Timer Channel Counter Register */
#define IMXRT_TMR1_CTRL1                    (IMXRT_QTIMER1_BASE + IMXRT_TMR1_CTRL1_OFFSET)    /* Timer Channel Control Register */
#define IMXRT_TMR1_SCTRL1                   (IMXRT_QTIMER1_BASE + IMXRT_TMR1_SCTRL1_OFFSET)   /* Timer Channel Status and Control Register */
#define IMXRT_TMR1_CMPLD11                  (IMXRT_QTIMER1_BASE + IMXRT_TMR1_CMPLD11_OFFSET)  /* Timer Channel Comparator Load Register 1 */
#define IMXRT_TMR1_CMPLD21                  (IMXRT_QTIMER1_BASE + IMXRT_TMR1_CMPLD21_OFFSET)  /* Timer Channel Comparator Load Register 2 */
#define IMXRT_TMR1_CSCTRL1                  (IMXRT_QTIMER1_BASE + IMXRT_TMR1_CSCTRL1_OFFSET)  /* Timer Channel Comparator Status and Control Register */
#define IMXRT_TMR1_FILT1                    (IMXRT_QTIMER1_BASE + IMXRT_TMR1_FILT1_OFFSET)    /* Timer Channel Input Filter Register */
#define IMXRT_TMR1_DMA1                     (IMXRT_QTIMER1_BASE + IMXRT_TMR1_DMA1_OFFSET)     /* Timer Channel DMA Enable Register */
#define IMXRT_TMR1_COMP12                   (IMXRT_QTIMER1_BASE + IMXRT_TMR1_COMP12_OFFSET)   /* Timer Channel Compare Register 1 */
#define IMXRT_TMR1_COMP22                   (IMXRT_QTIMER1_BASE + IMXRT_TMR1_COMP22_OFFSET)   /* Timer Channel Compare Register 2 */
#define IMXRT_TMR1_CAPT2                    (IMXRT_QTIMER1_BASE + IMXRT_TMR1_CAPT2_OFFSET)    /* Timer Channel Capture Register */
#define IMXRT_TMR1_LOAD2                    (IMXRT_QTIMER1_BASE + IMXRT_TMR1_LOAD2_OFFSET)    /* Timer Channel Load Register */
#define IMXRT_TMR1_HOLD2                    (IMXRT_QTIMER1_BASE + IMXRT_TMR1_HOLD2_OFFSET)    /* Timer Channel Hold Register */
#define IMXRT_TMR1_CNTR2                    (IMXRT_QTIMER1_BASE + IMXRT_TMR1_CNTR2_OFFSET)    /* Timer Channel Counter Register */
#define IMXRT_TMR1_CTRL2                    (IMXRT_QTIMER1_BASE + IMXRT_TMR1_CTRL2_OFFSET)    /* Timer Channel Control Register */
#define IMXRT_TMR1_SCTRL2                   (IMXRT_QTIMER1_BASE + IMXRT_TMR1_SCTRL2_OFFSET)   /* Timer Channel Status and Control Register */
#define IMXRT_TMR1_CMPLD12                  (IMXRT_QTIMER1_BASE + IMXRT_TMR1_CMPLD12_OFFSET)  /* Timer Channel Comparator Load Register 1 */
#define IMXRT_TMR1_CMPLD22                  (IMXRT_QTIMER1_BASE + IMXRT_TMR1_CMPLD22_OFFSET)  /* Timer Channel Comparator Load Register 2 */
#define IMXRT_TMR1_CSCTRL2                  (IMXRT_QTIMER1_BASE + IMXRT_TMR1_CSCTRL2_OFFSET)  /* Timer Channel Comparator Status and Control Register */
#define IMXRT_TMR1_FILT2                    (IMXRT_QTIMER1_BASE + IMXRT_TMR1_FILT2_OFFSET)    /* Timer Channel Input Filter Register */
#define IMXRT_TMR1_DMA2                     (IMXRT_QTIMER1_BASE + IMXRT_TMR1_DMA2_OFFSET)     /* Timer Channel DMA Enable Register */
#define IMXRT_TMR1_COMP13                   (IMXRT_QTIMER1_BASE + IMXRT_TMR1_COMP13_OFFSET)   /* Timer Channel Compare Register 1 */
#define IMXRT_TMR1_COMP23                   (IMXRT_QTIMER1_BASE + IMXRT_TMR1_COMP23_OFFSET)   /* Timer Channel Compare Register 2 */
#define IMXRT_TMR1_CAPT3                    (IMXRT_QTIMER1_BASE + IMXRT_TMR1_CAPT3_OFFSET)    /* Timer Channel Capture Register */
#define IMXRT_TMR1_LOAD3                    (IMXRT_QTIMER1_BASE + IMXRT_TMR1_LOAD3_OFFSET)    /* Timer Channel Load Register */
#define IMXRT_TMR1_HOLD3                    (IMXRT_QTIMER1_BASE + IMXRT_TMR1_HOLD3_OFFSET)    /* Timer Channel Hold Register */
#define IMXRT_TMR1_CNTR3                    (IMXRT_QTIMER1_BASE + IMXRT_TMR1_CNTR3_OFFSET)    /* Timer Channel Counter Register */
#define IMXRT_TMR1_CTRL3                    (IMXRT_QTIMER1_BASE + IMXRT_TMR1_CTRL3_OFFSET)    /* Timer Channel Control Register */
#define IMXRT_TMR1_SCTRL3                   (IMXRT_QTIMER1_BASE + IMXRT_TMR1_SCTRL3_OFFSET)   /* Timer Channel Status and Control Register */
#define IMXRT_TMR1_CMPLD13                  (IMXRT_QTIMER1_BASE + IMXRT_TMR1_CMPLD13_OFFSET)  /* Timer Channel Comparator Load Register 1 */
#define IMXRT_TMR1_CMPLD23                  (IMXRT_QTIMER1_BASE + IMXRT_TMR1_CMPLD23_OFFSET)  /* Timer Channel Comparator Load Register 2 */
#define IMXRT_TMR1_CSCTRL3                  (IMXRT_QTIMER1_BASE + IMXRT_TMR1_CSCTRL3_OFFSET)  /* Timer Channel Comparator Status and Control Register */
#define IMXRT_TMR1_FILT3                    (IMXRT_QTIMER1_BASE + IMXRT_TMR1_FILT3_OFFSET)    /* Timer Channel Input Filter Register */
#define IMXRT_TMR1_DMA3                     (IMXRT_QTIMER1_BASE + IMXRT_TMR1_DMA3_OFFSET)     /* Timer Channel DMA Enable Register */
#define IMXRT_TMR2_COMP10                   (IMXRT_QTIMER2_BASE + IMXRT_TMR2_COMP10_OFFSET)   /* Timer Channel Compare Register 1 */
#define IMXRT_TMR2_COMP20                   (IMXRT_QTIMER2_BASE + IMXRT_TMR2_COMP20_OFFSET)   /* Timer Channel Compare Register 2 */
#define IMXRT_TMR2_CAPT0                    (IMXRT_QTIMER2_BASE + IMXRT_TMR2_CAPT0_OFFSET)    /* Timer Channel Capture Register */
#define IMXRT_TMR2_LOAD0                    (IMXRT_QTIMER2_BASE + IMXRT_TMR2_LOAD0_OFFSET)    /* Timer Channel Load Register */
#define IMXRT_TMR2_HOLD0                    (IMXRT_QTIMER2_BASE + IMXRT_TMR2_HOLD0_OFFSET)    /* Timer Channel Hold Register */
#define IMXRT_TMR2_CNTR0                    (IMXRT_QTIMER2_BASE + IMXRT_TMR2_CNTR0_OFFSET)    /* Timer Channel Counter Register */
#define IMXRT_TMR2_CTRL0                    (IMXRT_QTIMER2_BASE + IMXRT_TMR2_CTRL0_OFFSET)    /* Timer Channel Control Register */
#define IMXRT_TMR2_SCTRL0                   (IMXRT_QTIMER2_BASE + IMXRT_TMR2_SCTRL0_OFFSET)   /* Timer Channel Status and Control Register */
#define IMXRT_TMR2_CMPLD10                  (IMXRT_QTIMER2_BASE + IMXRT_TMR2_CMPLD10_OFFSET)  /* Timer Channel Comparator Load Register 1 */
#define IMXRT_TMR2_CMPLD20                  (IMXRT_QTIMER2_BASE + IMXRT_TMR2_CMPLD20_OFFSET)  /* Timer Channel Comparator Load Register 2 */
#define IMXRT_TMR2_CSCTRL0                  (IMXRT_QTIMER2_BASE + IMXRT_TMR2_CSCTRL0_OFFSET)  /* Timer Channel Comparator Status and Control Register */
#define IMXRT_TMR2_FILT0                    (IMXRT_QTIMER2_BASE + IMXRT_TMR2_FILT0_OFFSET)    /* Timer Channel Input Filter Register */
#define IMXRT_TMR2_DMA0                     (IMXRT_QTIMER2_BASE + IMXRT_TMR2_DMA0_OFFSET)     /* Timer Channel DMA Enable Register */
#define IMXRT_TMR2_ENBL                     (IMXRT_QTIMER2_BASE + IMXRT_TMR2_ENBL_OFFSET)     /* Timer Channel Enable Register */
#define IMXRT_TMR2_COMP11                   (IMXRT_QTIMER2_BASE + IMXRT_TMR2_COMP11_OFFSET)   /* Timer Channel Compare Register 1 */
#define IMXRT_TMR2_COMP21                   (IMXRT_QTIMER2_BASE + IMXRT_TMR2_COMP21_OFFSET)   /* Timer Channel Compare Register 2 */
#define IMXRT_TMR2_CAPT1                    (IMXRT_QTIMER2_BASE + IMXRT_TMR2_CAPT1_OFFSET)    /* Timer Channel Capture Register */
#define IMXRT_TMR2_LOAD1                    (IMXRT_QTIMER2_BASE + IMXRT_TMR2_LOAD1_OFFSET)    /* Timer Channel Load Register */
#define IMXRT_TMR2_HOLD1                    (IMXRT_QTIMER2_BASE + IMXRT_TMR2_HOLD1_OFFSET)    /* Timer Channel Hold Register */
#define IMXRT_TMR2_CNTR1                    (IMXRT_QTIMER2_BASE + IMXRT_TMR2_CNTR1_OFFSET)    /* Timer Channel Counter Register */
#define IMXRT_TMR2_CTRL1                    (IMXRT_QTIMER2_BASE + IMXRT_TMR2_CTRL1_OFFSET)    /* Timer Channel Control Register */
#define IMXRT_TMR2_SCTRL1                   (IMXRT_QTIMER2_BASE + IMXRT_TMR2_SCTRL1_OFFSET)   /* Timer Channel Status and Control Register */
#define IMXRT_TMR2_CMPLD11                  (IMXRT_QTIMER2_BASE + IMXRT_TMR2_CMPLD11_OFFSET)  /* Timer Channel Comparator Load Register 1 */
#define IMXRT_TMR2_CMPLD21                  (IMXRT_QTIMER2_BASE + IMXRT_TMR2_CMPLD21_OFFSET)  /* Timer Channel Comparator Load Register 2 */
#define IMXRT_TMR2_CSCTRL1                  (IMXRT_QTIMER2_BASE + IMXRT_TMR2_CSCTRL1_OFFSET)  /* Timer Channel Comparator Status and Control Register */
#define IMXRT_TMR2_FILT1                    (IMXRT_QTIMER2_BASE + IMXRT_TMR2_FILT1_OFFSET)    /* Timer Channel Input Filter Register */
#define IMXRT_TMR2_DMA1                     (IMXRT_QTIMER2_BASE + IMXRT_TMR2_DMA1_OFFSET)     /* Timer Channel DMA Enable Register */
#define IMXRT_TMR2_COMP12                   (IMXRT_QTIMER2_BASE + IMXRT_TMR2_COMP12_OFFSET)   /* Timer Channel Compare Register 1 */
#define IMXRT_TMR2_COMP22                   (IMXRT_QTIMER2_BASE + IMXRT_TMR2_COMP22_OFFSET)   /* Timer Channel Compare Register 2 */
#define IMXRT_TMR2_CAPT2                    (IMXRT_QTIMER2_BASE + IMXRT_TMR2_CAPT2_OFFSET)    /* Timer Channel Capture Register */
#define IMXRT_TMR2_LOAD2                    (IMXRT_QTIMER2_BASE + IMXRT_TMR2_LOAD2_OFFSET)    /* Timer Channel Load Register */
#define IMXRT_TMR2_HOLD2                    (IMXRT_QTIMER2_BASE + IMXRT_TMR2_HOLD2_OFFSET)    /* Timer Channel Hold Register */
#define IMXRT_TMR2_CNTR2                    (IMXRT_QTIMER2_BASE + IMXRT_TMR2_CNTR2_OFFSET)    /* Timer Channel Counter Register */
#define IMXRT_TMR2_CTRL2                    (IMXRT_QTIMER2_BASE + IMXRT_TMR2_CTRL2_OFFSET)    /* Timer Channel Control Register */
#define IMXRT_TMR2_SCTRL2                   (IMXRT_QTIMER2_BASE + IMXRT_TMR2_SCTRL2_OFFSET)   /* Timer Channel Status and Control Register */
#define IMXRT_TMR2_CMPLD12                  (IMXRT_QTIMER2_BASE + IMXRT_TMR2_CMPLD12_OFFSET)  /* Timer Channel Comparator Load Register 1 */
#define IMXRT_TMR2_CMPLD22                  (IMXRT_QTIMER2_BASE + IMXRT_TMR2_CMPLD22_OFFSET)  /* Timer Channel Comparator Load Register 2 */
#define IMXRT_TMR2_CSCTRL2                  (IMXRT_QTIMER2_BASE + IMXRT_TMR2_CSCTRL2_OFFSET)  /* Timer Channel Comparator Status and Control Register */
#define IMXRT_TMR2_FILT2                    (IMXRT_QTIMER2_BASE + IMXRT_TMR2_FILT2_OFFSET)    /* Timer Channel Input Filter Register */
#define IMXRT_TMR2_DMA2                     (IMXRT_QTIMER2_BASE + IMXRT_TMR2_DMA2_OFFSET)     /* Timer Channel DMA Enable Register */
#define IMXRT_TMR2_COMP13                   (IMXRT_QTIMER2_BASE + IMXRT_TMR2_COMP13_OFFSET)   /* Timer Channel Compare Register 1 */
#define IMXRT_TMR2_COMP23                   (IMXRT_QTIMER2_BASE + IMXRT_TMR2_COMP23_OFFSET)   /* Timer Channel Compare Register 2 */
#define IMXRT_TMR2_CAPT3                    (IMXRT_QTIMER2_BASE + IMXRT_TMR2_CAPT3_OFFSET)    /* Timer Channel Capture Register */
#define IMXRT_TMR2_LOAD3                    (IMXRT_QTIMER2_BASE + IMXRT_TMR2_LOAD3_OFFSET)    /* Timer Channel Load Register */
#define IMXRT_TMR2_HOLD3                    (IMXRT_QTIMER2_BASE + IMXRT_TMR2_HOLD3_OFFSET)    /* Timer Channel Hold Register */
#define IMXRT_TMR2_CNTR3                    (IMXRT_QTIMER2_BASE + IMXRT_TMR2_CNTR3_OFFSET)    /* Timer Channel Counter Register */
#define IMXRT_TMR2_CTRL3                    (IMXRT_QTIMER2_BASE + IMXRT_TMR2_CTRL3_OFFSET)    /* Timer Channel Control Register */
#define IMXRT_TMR2_SCTRL3                   (IMXRT_QTIMER2_BASE + IMXRT_TMR2_SCTRL3_OFFSET)   /* Timer Channel Status and Control Register */
#define IMXRT_TMR2_CMPLD13                  (IMXRT_QTIMER2_BASE + IMXRT_TMR2_CMPLD13_OFFSET)  /* Timer Channel Comparator Load Register 1 */
#define IMXRT_TMR2_CMPLD23                  (IMXRT_QTIMER2_BASE + IMXRT_TMR2_CMPLD23_OFFSET)  /* Timer Channel Comparator Load Register 2 */
#define IMXRT_TMR2_CSCTRL3                  (IMXRT_QTIMER2_BASE + IMXRT_TMR2_CSCTRL3_OFFSET)  /* Timer Channel Comparator Status and Control Register */
#define IMXRT_TMR2_FILT3                    (IMXRT_QTIMER2_BASE + IMXRT_TMR2_FILT3_OFFSET)    /* Timer Channel Input Filter Register */
#define IMXRT_TMR2_DMA3                     (IMXRT_QTIMER2_BASE + IMXRT_TMR2_DMA3_OFFSET)     /* Timer Channel DMA Enable Register */
#define IMXRT_TMR3_COMP10                   (IMXRT_QTIMER3_BASE + IMXRT_TMR3_COMP10_OFFSET)   /* Timer Channel Compare Register 1 */
#define IMXRT_TMR3_COMP20                   (IMXRT_QTIMER3_BASE + IMXRT_TMR3_COMP20_OFFSET)   /* Timer Channel Compare Register 2 */
#define IMXRT_TMR3_CAPT0                    (IMXRT_QTIMER3_BASE + IMXRT_TMR3_CAPT0_OFFSET)    /* Timer Channel Capture Register */
#define IMXRT_TMR3_LOAD0                    (IMXRT_QTIMER3_BASE + IMXRT_TMR3_LOAD0_OFFSET)    /* Timer Channel Load Register */
#define IMXRT_TMR3_HOLD0                    (IMXRT_QTIMER3_BASE + IMXRT_TMR3_HOLD0_OFFSET)    /* Timer Channel Hold Register */
#define IMXRT_TMR3_CNTR0                    (IMXRT_QTIMER3_BASE + IMXRT_TMR3_CNTR0_OFFSET)    /* Timer Channel Counter Register */
#define IMXRT_TMR3_CTRL0                    (IMXRT_QTIMER3_BASE + IMXRT_TMR3_CTRL0_OFFSET)    /* Timer Channel Control Register */
#define IMXRT_TMR3_SCTRL0                   (IMXRT_QTIMER3_BASE + IMXRT_TMR3_SCTRL0_OFFSET)   /* Timer Channel Status and Control Register */
#define IMXRT_TMR3_CMPLD10                  (IMXRT_QTIMER3_BASE + IMXRT_TMR3_CMPLD10_OFFSET)  /* Timer Channel Comparator Load Register 1 */
#define IMXRT_TMR3_CMPLD20                  (IMXRT_QTIMER3_BASE + IMXRT_TMR3_CMPLD20_OFFSET)  /* Timer Channel Comparator Load Register 2 */
#define IMXRT_TMR3_CSCTRL0                  (IMXRT_QTIMER3_BASE + IMXRT_TMR3_CSCTRL0_OFFSET)  /* Timer Channel Comparator Status and Control Register */
#define IMXRT_TMR3_FILT0                    (IMXRT_QTIMER3_BASE + IMXRT_TMR3_FILT0_OFFSET)    /* Timer Channel Input Filter Register */
#define IMXRT_TMR3_DMA0                     (IMXRT_QTIMER3_BASE + IMXRT_TMR3_DMA0_OFFSET)     /* Timer Channel DMA Enable Register */
#define IMXRT_TMR3_ENBL                     (IMXRT_QTIMER3_BASE + IMXRT_TMR3_ENBL_OFFSET)     /* Timer Channel Enable Register */
#define IMXRT_TMR3_COMP11                   (IMXRT_QTIMER3_BASE + IMXRT_TMR3_COMP11_OFFSET)   /* Timer Channel Compare Register 1 */
#define IMXRT_TMR3_COMP21                   (IMXRT_QTIMER3_BASE + IMXRT_TMR3_COMP21_OFFSET)   /* Timer Channel Compare Register 2 */
#define IMXRT_TMR3_CAPT1                    (IMXRT_QTIMER3_BASE + IMXRT_TMR3_CAPT1_OFFSET)    /* Timer Channel Capture Register */
#define IMXRT_TMR3_LOAD1                    (IMXRT_QTIMER3_BASE + IMXRT_TMR3_LOAD1_OFFSET)    /* Timer Channel Load Register */
#define IMXRT_TMR3_HOLD1                    (IMXRT_QTIMER3_BASE + IMXRT_TMR3_HOLD1_OFFSET)    /* Timer Channel Hold Register */
#define IMXRT_TMR3_CNTR1                    (IMXRT_QTIMER3_BASE + IMXRT_TMR3_CNTR1_OFFSET)    /* Timer Channel Counter Register */
#define IMXRT_TMR3_CTRL1                    (IMXRT_QTIMER3_BASE + IMXRT_TMR3_CTRL1_OFFSET)    /* Timer Channel Control Register */
#define IMXRT_TMR3_SCTRL1                   (IMXRT_QTIMER3_BASE + IMXRT_TMR3_SCTRL1_OFFSET)   /* Timer Channel Status and Control Register */
#define IMXRT_TMR3_CMPLD11                  (IMXRT_QTIMER3_BASE + IMXRT_TMR3_CMPLD11_OFFSET)  /* Timer Channel Comparator Load Register 1 */
#define IMXRT_TMR3_CMPLD21                  (IMXRT_QTIMER3_BASE + IMXRT_TMR3_CMPLD21_OFFSET)  /* Timer Channel Comparator Load Register 2 */
#define IMXRT_TMR3_CSCTRL1                  (IMXRT_QTIMER3_BASE + IMXRT_TMR3_CSCTRL1_OFFSET)  /* Timer Channel Comparator Status and Control Register */
#define IMXRT_TMR3_FILT1                    (IMXRT_QTIMER3_BASE + IMXRT_TMR3_FILT1_OFFSET)    /* Timer Channel Input Filter Register */
#define IMXRT_TMR3_DMA1                     (IMXRT_QTIMER3_BASE + IMXRT_TMR3_DMA1_OFFSET)     /* Timer Channel DMA Enable Register */
#define IMXRT_TMR3_COMP12                   (IMXRT_QTIMER3_BASE + IMXRT_TMR3_COMP12_OFFSET)   /* Timer Channel Compare Register 1 */
#define IMXRT_TMR3_COMP22                   (IMXRT_QTIMER3_BASE + IMXRT_TMR3_COMP22_OFFSET)   /* Timer Channel Compare Register 2 */
#define IMXRT_TMR3_CAPT2                    (IMXRT_QTIMER3_BASE + IMXRT_TMR3_CAPT2_OFFSET)    /* Timer Channel Capture Register */
#define IMXRT_TMR3_LOAD2                    (IMXRT_QTIMER3_BASE + IMXRT_TMR3_LOAD2_OFFSET)    /* Timer Channel Load Register */
#define IMXRT_TMR3_HOLD2                    (IMXRT_QTIMER3_BASE + IMXRT_TMR3_HOLD2_OFFSET)    /* Timer Channel Hold Register */
#define IMXRT_TMR3_CNTR2                    (IMXRT_QTIMER3_BASE + IMXRT_TMR3_CNTR2_OFFSET)    /* Timer Channel Counter Register */
#define IMXRT_TMR3_CTRL2                    (IMXRT_QTIMER3_BASE + IMXRT_TMR3_CTRL2_OFFSET)    /* Timer Channel Control Register */
#define IMXRT_TMR3_SCTRL2                   (IMXRT_QTIMER3_BASE + IMXRT_TMR3_SCTRL2_OFFSET)   /* Timer Channel Status and Control Register */
#define IMXRT_TMR3_CMPLD12                  (IMXRT_QTIMER3_BASE + IMXRT_TMR3_CMPLD12_OFFSET)  /* Timer Channel Comparator Load Register 1 */
#define IMXRT_TMR3_CMPLD22                  (IMXRT_QTIMER3_BASE + IMXRT_TMR3_CMPLD22_OFFSET)  /* Timer Channel Comparator Load Register 2 */
#define IMXRT_TMR3_CSCTRL2                  (IMXRT_QTIMER3_BASE + IMXRT_TMR3_CSCTRL2_OFFSET)  /* Timer Channel Comparator Status and Control Register */
#define IMXRT_TMR3_FILT2                    (IMXRT_QTIMER3_BASE + IMXRT_TMR3_FILT2_OFFSET)    /* Timer Channel Input Filter Register */
#define IMXRT_TMR3_DMA2                     (IMXRT_QTIMER3_BASE + IMXRT_TMR3_DMA2_OFFSET)     /* Timer Channel DMA Enable Register */
#define IMXRT_TMR3_COMP13                   (IMXRT_QTIMER3_BASE + IMXRT_TMR3_COMP13_OFFSET)   /* Timer Channel Compare Register 1 */
#define IMXRT_TMR3_COMP23                   (IMXRT_QTIMER3_BASE + IMXRT_TMR3_COMP23_OFFSET)   /* Timer Channel Compare Register 2 */
#define IMXRT_TMR3_CAPT3                    (IMXRT_QTIMER3_BASE + IMXRT_TMR3_CAPT3_OFFSET)    /* Timer Channel Capture Register */
#define IMXRT_TMR3_LOAD3                    (IMXRT_QTIMER3_BASE + IMXRT_TMR3_LOAD3_OFFSET)    /* Timer Channel Load Register */
#define IMXRT_TMR3_HOLD3                    (IMXRT_QTIMER3_BASE + IMXRT_TMR3_HOLD3_OFFSET)    /* Timer Channel Hold Register */
#define IMXRT_TMR3_CNTR3                    (IMXRT_QTIMER3_BASE + IMXRT_TMR3_CNTR3_OFFSET)    /* Timer Channel Counter Register */
#define IMXRT_TMR3_CTRL3                    (IMXRT_QTIMER3_BASE + IMXRT_TMR3_CTRL3_OFFSET)    /* Timer Channel Control Register */
#define IMXRT_TMR3_SCTRL3                   (IMXRT_QTIMER3_BASE + IMXRT_TMR3_SCTRL3_OFFSET)   /* Timer Channel Status and Control Register */
#define IMXRT_TMR3_CMPLD13                  (IMXRT_QTIMER3_BASE + IMXRT_TMR3_CMPLD13_OFFSET)  /* Timer Channel Comparator Load Register 1 */
#define IMXRT_TMR3_CMPLD23                  (IMXRT_QTIMER3_BASE + IMXRT_TMR3_CMPLD23_OFFSET)  /* Timer Channel Comparator Load Register 2 */
#define IMXRT_TMR3_CSCTRL3                  (IMXRT_QTIMER3_BASE + IMXRT_TMR3_CSCTRL3_OFFSET)  /* Timer Channel Comparator Status and Control Register */
#define IMXRT_TMR3_FILT3                    (IMXRT_QTIMER3_BASE + IMXRT_TMR3_FILT3_OFFSET)    /* Timer Channel Input Filter Register */
#define IMXRT_TMR3_DMA3                     (IMXRT_QTIMER3_BASE + IMXRT_TMR3_DMA3_OFFSET)     /* Timer Channel DMA Enable Register */
#define IMXRT_TMR4_COMP10                   (IMXRT_QTIMER4_BASE + IMXRT_TMR4_COMP10_OFFSET)   /* Timer Channel Compare Register 1 */
#define IMXRT_TMR4_COMP20                   (IMXRT_QTIMER4_BASE + IMXRT_TMR4_COMP20_OFFSET)   /* Timer Channel Compare Register 2 */
#define IMXRT_TMR4_CAPT0                    (IMXRT_QTIMER4_BASE + IMXRT_TMR4_CAPT0_OFFSET)    /* Timer Channel Capture Register */
#define IMXRT_TMR4_LOAD0                    (IMXRT_QTIMER4_BASE + IMXRT_TMR4_LOAD0_OFFSET)    /* Timer Channel Load Register */
#define IMXRT_TMR4_HOLD0                    (IMXRT_QTIMER4_BASE + IMXRT_TMR4_HOLD0_OFFSET)    /* Timer Channel Hold Register */
#define IMXRT_TMR4_CNTR0                    (IMXRT_QTIMER4_BASE + IMXRT_TMR4_CNTR0_OFFSET)    /* Timer Channel Counter Register */
#define IMXRT_TMR4_CTRL0                    (IMXRT_QTIMER4_BASE + IMXRT_TMR4_CTRL0_OFFSET)    /* Timer Channel Control Register */
#define IMXRT_TMR4_SCTRL0                   (IMXRT_QTIMER4_BASE + IMXRT_TMR4_SCTRL0_OFFSET)   /* Timer Channel Status and Control Register */
#define IMXRT_TMR4_CMPLD10                  (IMXRT_QTIMER4_BASE + IMXRT_TMR4_CMPLD10_OFFSET)  /* Timer Channel Comparator Load Register 1 */
#define IMXRT_TMR4_CMPLD20                  (IMXRT_QTIMER4_BASE + IMXRT_TMR4_CMPLD20_OFFSET)  /* Timer Channel Comparator Load Register 2 */
#define IMXRT_TMR4_CSCTRL0                  (IMXRT_QTIMER4_BASE + IMXRT_TMR4_CSCTRL0_OFFSET)  /* Timer Channel Comparator Status and Control Register */
#define IMXRT_TMR4_FILT0                    (IMXRT_QTIMER4_BASE + IMXRT_TMR4_FILT0_OFFSET)    /* Timer Channel Input Filter Register */
#define IMXRT_TMR4_DMA0                     (IMXRT_QTIMER4_BASE + IMXRT_TMR4_DMA0_OFFSET)     /* Timer Channel DMA Enable Register */
#define IMXRT_TMR4_ENBL                     (IMXRT_QTIMER4_BASE + IMXRT_TMR4_ENBL_OFFSET)     /* Timer Channel Enable Register */
#define IMXRT_TMR4_COMP11                   (IMXRT_QTIMER4_BASE + IMXRT_TMR4_COMP11_OFFSET)   /* Timer Channel Compare Register 1 */
#define IMXRT_TMR4_COMP21                   (IMXRT_QTIMER4_BASE + IMXRT_TMR4_COMP21_OFFSET)   /* Timer Channel Compare Register 2 */
#define IMXRT_TMR4_CAPT1                    (IMXRT_QTIMER4_BASE + IMXRT_TMR4_CAPT1_OFFSET)    /* Timer Channel Capture Register */
#define IMXRT_TMR4_LOAD1                    (IMXRT_QTIMER4_BASE + IMXRT_TMR4_LOAD1_OFFSET)    /* Timer Channel Load Register */
