apache/nuttx/arch/arm/src/imxrt/hardware/imxrt_tmr.h
#define IMXRT_TMR4_HOLD1                    (IMXRT_QTIMER4_BASE + IMXRT_TMR4_HOLD1_OFFSET)    /* Timer Channel Hold Register */
#define IMXRT_TMR4_CNTR1                    (IMXRT_QTIMER4_BASE + IMXRT_TMR4_CNTR1_OFFSET)    /* Timer Channel Counter Register */
#define IMXRT_TMR4_CTRL1                    (IMXRT_QTIMER4_BASE + IMXRT_TMR4_CTRL1_OFFSET)    /* Timer Channel Control Register */
#define IMXRT_TMR4_SCTRL1                   (IMXRT_QTIMER4_BASE + IMXRT_TMR4_SCTRL1_OFFSET)   /* Timer Channel Status and Control Register */
#define IMXRT_TMR4_CMPLD11                  (IMXRT_QTIMER4_BASE + IMXRT_TMR4_CMPLD11_OFFSET)  /* Timer Channel Comparator Load Register 1 */
#define IMXRT_TMR4_CMPLD21                  (IMXRT_QTIMER4_BASE + IMXRT_TMR4_CMPLD21_OFFSET)  /* Timer Channel Comparator Load Register 2 */
#define IMXRT_TMR4_CSCTRL1                  (IMXRT_QTIMER4_BASE + IMXRT_TMR4_CSCTRL1_OFFSET)  /* Timer Channel Comparator Status and Control Register */
#define IMXRT_TMR4_FILT1                    (IMXRT_QTIMER4_BASE + IMXRT_TMR4_FILT1_OFFSET)    /* Timer Channel Input Filter Register */
#define IMXRT_TMR4_DMA1                     (IMXRT_QTIMER4_BASE + IMXRT_TMR4_DMA1_OFFSET)     /* Timer Channel DMA Enable Register */
#define IMXRT_TMR4_COMP12                   (IMXRT_QTIMER4_BASE + IMXRT_TMR4_COMP12_OFFSET)   /* Timer Channel Compare Register 1 */
#define IMXRT_TMR4_COMP22                   (IMXRT_QTIMER4_BASE + IMXRT_TMR4_COMP22_OFFSET)   /* Timer Channel Compare Register 2 */
#define IMXRT_TMR4_CAPT2                    (IMXRT_QTIMER4_BASE + IMXRT_TMR4_CAPT2_OFFSET)    /* Timer Channel Capture Register */
#define IMXRT_TMR4_LOAD2                    (IMXRT_QTIMER4_BASE + IMXRT_TMR4_LOAD2_OFFSET)    /* Timer Channel Load Register */
#define IMXRT_TMR4_HOLD2                    (IMXRT_QTIMER4_BASE + IMXRT_TMR4_HOLD2_OFFSET)    /* Timer Channel Hold Register */
#define IMXRT_TMR4_CNTR2                    (IMXRT_QTIMER4_BASE + IMXRT_TMR4_CNTR2_OFFSET)    /* Timer Channel Counter Register */
#define IMXRT_TMR4_CTRL2                    (IMXRT_QTIMER4_BASE + IMXRT_TMR4_CTRL2_OFFSET)    /* Timer Channel Control Register */
#define IMXRT_TMR4_SCTRL2                   (IMXRT_QTIMER4_BASE + IMXRT_TMR4_SCTRL2_OFFSET)   /* Timer Channel Status and Control Register */
#define IMXRT_TMR4_CMPLD12                  (IMXRT_QTIMER4_BASE + IMXRT_TMR4_CMPLD12_OFFSET)  /* Timer Channel Comparator Load Register 1 */
#define IMXRT_TMR4_CMPLD22                  (IMXRT_QTIMER4_BASE + IMXRT_TMR4_CMPLD22_OFFSET)  /* Timer Channel Comparator Load Register 2 */
#define IMXRT_TMR4_CSCTRL2                  (IMXRT_QTIMER4_BASE + IMXRT_TMR4_CSCTRL2_OFFSET)  /* Timer Channel Comparator Status and Control Register */
#define IMXRT_TMR4_FILT2                    (IMXRT_QTIMER4_BASE + IMXRT_TMR4_FILT2_OFFSET)    /* Timer Channel Input Filter Register */
#define IMXRT_TMR4_DMA2                     (IMXRT_QTIMER4_BASE + IMXRT_TMR4_DMA2_OFFSET)     /* Timer Channel DMA Enable Register */
#define IMXRT_TMR4_COMP13                   (IMXRT_QTIMER4_BASE + IMXRT_TMR4_COMP13_OFFSET)   /* Timer Channel Compare Register 1 */
#define IMXRT_TMR4_COMP23                   (IMXRT_QTIMER4_BASE + IMXRT_TMR4_COMP23_OFFSET)   /* Timer Channel Compare Register 2 */
#define IMXRT_TMR4_CAPT3                    (IMXRT_QTIMER4_BASE + IMXRT_TMR4_CAPT3_OFFSET)    /* Timer Channel Capture Register */
#define IMXRT_TMR4_LOAD3                    (IMXRT_QTIMER4_BASE + IMXRT_TMR4_LOAD3_OFFSET)    /* Timer Channel Load Register */
#define IMXRT_TMR4_HOLD3                    (IMXRT_QTIMER4_BASE + IMXRT_TMR4_HOLD3_OFFSET)    /* Timer Channel Hold Register */
#define IMXRT_TMR4_CNTR3                    (IMXRT_QTIMER4_BASE + IMXRT_TMR4_CNTR3_OFFSET)    /* Timer Channel Counter Register */
#define IMXRT_TMR4_CTRL3                    (IMXRT_QTIMER4_BASE + IMXRT_TMR4_CTRL3_OFFSET)    /* Timer Channel Control Register */
#define IMXRT_TMR4_SCTRL3                   (IMXRT_QTIMER4_BASE + IMXRT_TMR4_SCTRL3_OFFSET)   /* Timer Channel Status and Control Register */
#define IMXRT_TMR4_CMPLD13                  (IMXRT_QTIMER4_BASE + IMXRT_TMR4_CMPLD13_OFFSET)  /* Timer Channel Comparator Load Register 1 */
#define IMXRT_TMR4_CMPLD23                  (IMXRT_QTIMER4_BASE + IMXRT_TMR4_CMPLD23_OFFSET)  /* Timer Channel Comparator Load Register 2 */
#define IMXRT_TMR4_CSCTRL3                  (IMXRT_QTIMER4_BASE + IMXRT_TMR4_CSCTRL3_OFFSET)  /* Timer Channel Comparator Status and Control Register */
#define IMXRT_TMR4_FILT3                    (IMXRT_QTIMER4_BASE + IMXRT_TMR4_FILT3_OFFSET)    /* Timer Channel Input Filter Register */
#define IMXRT_TMR4_DMA3                     (IMXRT_QTIMER4_BASE + IMXRT_TMR4_DMA3_OFFSET)     /* Timer Channel DMA Enable Register */

/* Register Bit Definitions *****************************************************************************************************************/

/* Timer Channel Control Register */

#define TMR_CTRL_OUTMODE_SHIFT         (0)        /* Bits: 0-2  Output Mode */
#define TMR_CTRL_OUTMODE_MASK          (7 << TMR_CTRL_OUTMODE_SHIFT)
#  define TMR_CTRL_OUTMODE(n)          ((uint32_t)(n) << TMR_CTRL_OUTMODE_SHIFT)
#  define TMR_CTRL_OUTMODE_ON          (0 << TMR_CTRL_OUTMODE_SHIFT)  /* Asserted while counter is active */
#  define TMR_CTRL_OUTMODE_CLEAR       (1 << TMR_CTRL_OUTMODE_SHIFT)  /* Clear OFLAG output on successful compare */
#  define TMR_CTRL_OUTMODE_SET         (2 << TMR_CTRL_OUTMODE_SHIFT)  /* Set OFLAG output on successful compare */
#  define TMR_CTRL_OUTMODE_TOGGLE      (3 << TMR_CTRL_OUTMODE_SHIFT)  /* Toggle OFLAG output on successful compare */
#  define TMR_CTRL_OUTMODE_TOG_ALT     (4 << TMR_CTRL_OUTMODE_SHIFT)  /* Toggle OFLAG output using alternating compare registers */
#  define TMR_CTRL_OUTMODE_SET_CLR     (5 << TMR_CTRL_OUTMODE_SHIFT)  /* Set on compare, cleared on secondary source input edge */
#  define TMR_CTRL_OUTMODE_SET_CLR_ROL (6 << TMR_CTRL_OUTMODE_SHIFT)  /* Set on compare, cleared on counter rollover */
#  define TMR_CTRL_OUTMODE_GATED       (7 << TMR_CTRL_OUTMODE_SHIFT)  /* Enable gated clock output while counter is active */
#define TMR_CTRL_COINIT                (1 << 3)   /* Bit: 3  Co-Channel Initialization */
#define TMR_CTRL_DIR                   (1 << 4)   /* Bit: 4  Count Direction */
#define TMR_CTRL_LENGTH                (1 << 5)   /* Bit: 5  Count Length */
#define TMR_CTRL_ONCE                  (1 << 6)   /* Bit: 6  Count Once */
#define TMR_CTRL_SCS_SHIFT             (7)        /* Bits: 7-8  Secondary Count Source */
#define TMR_CTRL_SCS_MASK              (3 << TMR_CTRL_SCS_SHIFT)
#  define TMR_CTRL_SCS(n)              ((uint32_t)(n) << TMR_CTRL_SCS_SHIFT)
#  define TMR_CTRL_SCS_CNTR0           (0 << TMR_CTRL_SCS_SHIFT)  /* Counter 0 input pin */
#  define TMR_CTRL_SCS_CNTR1           (1 << TMR_CTRL_SCS_SHIFT)  /* Counter 1 input pin */
#  define TMR_CTRL_SCS_CNTR2           (2 << TMR_CTRL_SCS_SHIFT)  /* Counter 2 input pin */
#  define TMR_CTRL_SCS_CNTR3           (3 << TMR_CTRL_SCS_SHIFT)  /* Counter 3 input pin */
#define TMR_CTRL_PCS_SHIFT             (9)        /* Bits: 9-12  Primary Count Source */
#define TMR_CTRL_PCS_MASK              (15 << TMR_CTRL_PCS_SHIFT)
#  define TMR_CTRL_PCS(n)              ((uint32_t)(n) << TMR_CTRL_PCS_SHIFT)
#  define TMR_CTRL_PCS_CNTR0           (0 << TMR_CTRL_PCS_SHIFT)  /* Counter 0 input pin */
#  define TMR_CTRL_PCS_CNTR1           (1 << TMR_CTRL_PCS_SHIFT)  /* Counter 1 input pin */
#  define TMR_CTRL_PCS_CNTR2           (2 << TMR_CTRL_PCS_SHIFT)  /* Counter 2 input pin */
#  define TMR_CTRL_PCS_CNTR3           (3 << TMR_CTRL_PCS_SHIFT)  /* Counter 3 input pin */
#  define TMR_CTRL_PCS_OUT0            (4 << TMR_CTRL_PCS_SHIFT)  /* Counter 0 output */
#  define TMR_CTRL_PCS_OUT1            (5 << TMR_CTRL_PCS_SHIFT)  /* Counter 1 output */
#  define TMR_CTRL_PCS_OUT2            (6 << TMR_CTRL_PCS_SHIFT)  /* Counter 2 output */
#  define TMR_CTRL_PCS_OUT3            (7 << TMR_CTRL_PCS_SHIFT)  /* Counter 3 output */
#  define TMR_CTRL_PCS_DIV1            (8 << TMR_CTRL_PCS_SHIFT)  /* IP bus clock divide by 1 prescaler */
#  define TMR_CTRL_PCS_DIV2            (9 << TMR_CTRL_PCS_SHIFT)  /* IP bus clock divide by 2 prescaler */
#  define TMR_CTRL_PCS_DIV4            (10 << TMR_CTRL_PCS_SHIFT)  /*IP bus clock divide by 4 prescaler */
#  define TMR_CTRL_PCS_DIV8            (11 << TMR_CTRL_PCS_SHIFT)  /*IP bus clock divide by 8 prescaler */
#  define TMR_CTRL_PCS_DIV16           (12 << TMR_CTRL_PCS_SHIFT)  /*IP bus clock divide by 16 prescaler */
#  define TMR_CTRL_PCS_DIV32           (13 << TMR_CTRL_PCS_SHIFT)  /*IP bus clock divide by 32 prescaler */
#  define TMR_CTRL_PCS_DIV64           (14 << TMR_CTRL_PCS_SHIFT)  /*IP bus clock divide by 64 prescaler */
#  define TMR_CTRL_PCS_DIV128          (15 << TMR_CTRL_PCS_SHIFT)  /*IP bus clock divide by 128 prescaler */
#define TMR_CTRL_CM_SHIFT              (13)       /* Bits: 13-15  Count Mode */
#define TMR_CTRL_CM_MASK               (7 << TMR_CTRL_CM_SHIFT)
#  define TMR_CTRL_CM(n)               ((uint32_t)(n) << TMR_CTRL_CM_SHIFT)
#  define TMR_CTRL_CM_MODE0            (0 << TMR_CTRL_CM_SHIFT)  /* No operation */
#  define TMR_CTRL_CM_MODE1            (1 << TMR_CTRL_CM_SHIFT)  /* Count rising edges of primary source */
#  define TMR_CTRL_CM_MODE2            (2 << TMR_CTRL_CM_SHIFT)  /* Count rising and falling edges of primary source */
#  define TMR_CTRL_CM_MODE3            (3 << TMR_CTRL_CM_SHIFT)  /* Count rising edges of primary source while secondary input high active */
#  define TMR_CTRL_CM_MODE4            (4 << TMR_CTRL_CM_SHIFT)  /* Quadrature count mode, uses primary and secondary sources */
#  define TMR_CTRL_CM_MODE5            (5 << TMR_CTRL_CM_SHIFT)  /* Count rising edges of primary source; secondary source specifies direction */
#  define TMR_CTRL_CM_MODE6            (6 << TMR_CTRL_CM_SHIFT)  /* Edge of secondary source triggers primary count until compare */
#  define TMR_CTRL_CM_MODE7            (7 << TMR_CTRL_CM_SHIFT)  /* Cascaded counter mode (up/down)*/

