apache/nuttx/arch/arm/src/imxrt/hardware/imxrt_tmr.h
/* Timer Channel Status and Control Register */

#define TMR_SCTRL_OEN                  (1 << 0)   /* Bit: 0  Output Enable */
#define TMR_SCTRL_OPS                  (1 << 1)   /* Bit: 1  Output Polarity Select */
#define TMR_SCTRL_FORCE                (1 << 2)   /* Bit: 2  Force OFLAG Output */
#define TMR_SCTRL_VAL                  (1 << 3)   /* Bit: 3  Forced OFLAG Value */
#define TMR_SCTRL_EEOF                 (1 << 4)   /* Bit: 4  Enable External OFLAG Force */
#define TMR_SCTRL_MSTR                 (1 << 5)   /* Bit: 5  Master Mode */
#define TMR_SCTRL_CAPTURE_MODE_SHIFT   (6)        /* Bits: 6-7  Input Capture Mode */
#define TMR_SCTRL_CAPTURE_MODE_MASK    (3 << TMR_SCTRL_CAPTURE_MODE_SHIFT)
#  define TMR_SCTRL_CAPTURE_MODE(n)    ((uint32_t)(n) << TMR_SCTRL_CAPTURE_MODE_SHIFT)
#  define TMR_SCTRL_CAPTURE_DIS        (0 << TMR_SCTRL_CAPTURE_MODE_SHIFT)  /* Capture function is disabled */
#  define TMR_SCTRL_CAPTURE_RISING     (1 << TMR_SCTRL_CAPTURE_MODE_SHIFT)  /* Load capture register on rising edge (when IPS=0) or falling edge (when IPS=1) of input */
#  define TMR_SCTRL_CAPTURE_FALLING    (2 << TMR_SCTRL_CAPTURE_MODE_SHIFT)  /* Load capture register on falling edge (when IPS=0) or rising edge (when IPS=1) of input */
#  define TMR_SCTRL_CAPTURE_BOTH       (3 << TMR_SCTRL_CAPTURE_MODE_SHIFT)  /* Load capture register on both edges of input */
#define TMR_SCTRL_INPUT                (1 << 8)   /* Bit: 8  External Input Signal */
#define TMR_SCTRL_IPS                  (1 << 9)   /* Bit: 9  Input Polarity Select */
#define TMR_SCTRL_IEFIE                (1 << 10)  /* Bit: 10 Input Edge Flag Interrupt Enable */
#define TMR_SCTRL_IEF                  (1 << 11)  /* Bit: 11 Input Edge Flag */
#define TMR_SCTRL_TOFIE                (1 << 12)  /* Bit: 12 Timer Overflow Flag Interrupt Enable */
#define TMR_SCTRL_TOF                  (1 << 13)  /* Bit: 13 Timer Overflow Flag */
#define TMR_SCTRL_TCFIE                (1 << 14)  /* Bit: 14 Timer Compare Flag Interrupt Enable */
#define TMR_SCTRL_TCF                  (1 << 15)  /* Bit: 15 Timer Compare Flag */

/* Timer Channel Comparator Status and Control Register */

#define TMR_CSCTRL_CL1_SHIFT           (0)        /* Bits: 0-1  Compare Load Control 1 */
#define TMR_CSCTRL_CL1_MASK            (3 << TMR_CSCTRL_CL1_SHIFT)
#  define TMR_CSCTRL_CL1(n)            ((uint32_t)(n) << TMR_CSCTRL_CL1_SHIFT)
#  define TMR_CSCTRL_CL1_DIS           (0 << TMR_CSCTRL_CL1_SHIFT)  /* Never preload */
#  define TMR_CSCTRL_CL1_COMP1         (1 << TMR_CSCTRL_CL1_SHIFT)  /* Load upon successful compare with the value in COMP1 */
#  define TMR_CSCTRL_CL1_COMP2         (2 << TMR_CSCTRL_CL1_SHIFT)  /* Load upon successful compare with the value in COMP2 */
#define TMR_CSCTRL_CL2_SHIFT           (2)        /* Bits: 2-3  Compare Load Control 2 */
#define TMR_CSCTRL_CL2_MASK            (3 << TMR_CSCTRL_CL2_SHIFT)
#  define TMR_CSCTRL_CL2(n)            ((uint32_t)(n) << TMR_CSCTRL_CL2_SHIFT)
#  define TMR_CSCTRL_CL2_DIS           (0 << TMR_CSCTRL_CL2_SHIFT)  /* Never preload */
#  define TMR_CSCTRL_CL2_COMP1         (1 << TMR_CSCTRL_CL2_SHIFT)  /* Load upon successful compare with the value in COMP1 */
#  define TMR_CSCTRL_CL2_COMP2         (2 << TMR_CSCTRL_CL2_SHIFT)  /* Load upon successful compare with the value in COMP2 */
#define TMR_CSCTRL_TCF1                (1 << 4)   /* Bit: 4  Timer Compare 1 Interrupt Flag */
#define TMR_CSCTRL_TCF2                (1 << 5)   /* Bit: 5  Timer Compare 2 Interrupt Flag */
#define TMR_CSCTRL_TCF1EN              (1 << 6)   /* Bit: 6  Timer Compare 1 Interrupt Enable */
#define TMR_CSCTRL_TCF2EN              (1 << 7)   /* Bit: 7  Timer Compare 2 Interrupt Enable */
                                                  /* Bit: 8  This field is reserved. */
#define TMR_CSCTRL_UP                  (1 << 9)   /* Bit: 9  Counting Direction Indicator */
#define TMR_CSCTRL_TCI                 (1 << 10)  /* Bit: 10 Triggered Count Initialization Control */
#define TMR_CSCTRL_ROC                 (1 << 11)  /* Bit: 11 Reload on Capture */
#define TMR_CSCTRL_ALT_LOAD            (1 << 12)  /* Bit: 12 Alternative Load Enable */
#define TMR_CSCTRL_FAULT               (1 << 13)  /* Bit: 13 Fault Enable */
#define TMR_CSCTRL_DBG_EN_SHIFT        (14)       /* Bits: 14-15  Debug Actions Enable */
#define TMR_CSCTRL_DBG_EN_MASK         (3 << TMR_CSCTRL_DBG_EN_SHIFT)
#  define TMR_CSCTRL_DBG_EN(n)         ((uint32_t)(n) << TMR_CSCTRL_DBG_EN_SHIFT)
#  define TMR_CSCTRL_DBG_EN_NORMAL     (0 << TMR_CSCTRL_DBG_EN_SHIFT)  /* Continue with normal operation during debug mode. (default) */
#  define TMR_CSCTRL_DBG_EN_HALT       (1 << TMR_CSCTRL_DBG_EN_SHIFT)  /* Halt TMR counter during debug mode. */
#  define TMR_CSCTRL_DBG_EN_FORCE      (2 << TMR_CSCTRL_DBG_EN_SHIFT)  /* Force TMR output to logic 0 (prior to consideration of SCTRL[OPS]). */
#  define TMR_CSCTRL_DBG_EN_HALT_FORCE (3 << TMR_CSCTRL_DBG_EN_SHIFT)  /* Both halt counter and force output to 0 during debug mode.*/

/* Timer Channel Input Filter Register */

#define TMR_FILT_FILT_PER_SHIFT        (0)        /* Bits: 0-7  Input Filter Sample Period */
#define TMR_FILT_FILT_PER_MASK         (0xff << TMR_FILT_FILT_PER_SHIFT)
#  define TMR_FILT_FILT_PER(n)         ((uint32_t)(n) << TMR_FILT_FILT_PER_SHIFT)
#define TMR_FILT_FILT_CNT_SHIFT        (8)        /* Bits: 8-10  Input Filter Sample Count */
#define TMR_FILT_FILT_CNT_MASK         (7 << TMR_FILT_FILT_CNT_SHIFT)
#  define TMR_FILT_FILT_CNT(n)         ((uint32_t)(n) << TMR_FILT_FILT_CNT_SHIFT)
#  define TMR_FILT_FILT_CNT_3          (0 << TMR_FILT_FILT_CNT_SHIFT)  /* These bits represent the number of consecutive */
#  define TMR_FILT_FILT_CNT_4          (1 << TMR_FILT_FILT_CNT_SHIFT)  /* samples that must agree prior to the input */
#  define TMR_FILT_FILT_CNT_5          (2 << TMR_FILT_FILT_CNT_SHIFT)  /* filter accepting an input transition. A value */
#  define TMR_FILT_FILT_CNT_6          (3 << TMR_FILT_FILT_CNT_SHIFT)  /* of 0x0 represents 3 samples. A value of 0x7 */
#  define TMR_FILT_FILT_CNT_7          (4 << TMR_FILT_FILT_CNT_SHIFT)  /* represents 10 samples. The value */
#  define TMR_FILT_FILT_CNT_8          (5 << TMR_FILT_FILT_CNT_SHIFT)  /* of FILT_CNT affects the input latency. */
#  define TMR_FILT_FILT_CNT_9          (6 << TMR_FILT_FILT_CNT_SHIFT)
#  define TMR_FILT_FILT_CNT_10         (7 << TMR_FILT_FILT_CNT_SHIFT)
                                                  /* Bits: 11-15  Reserved */

/* Timer Channel DMA Enable Register */

#define TMR_DMA_IEFDE                  (1 << 0)   /* Bit: 0  Input Edge Flag DMA Enable */
#define TMR_DMA_CMPLD1DE               (1 << 1)   /* Bit: 1  Comparator Preload Register 1 DMA Enable */
#define TMR_DMA_CMPLD2DE               (1 << 2)   /* Bit: 2  Comparator Preload Register 2 DMA Enable */
                                                  /* Bits: 3-15  Reserved */

/* Timer Channel Enable Register */

#define TMR_ENBL_ENBL_SHIFT            (0)        /* Bits: 0-3  Timer Channel Enable */
#define TMR_ENBL_ENBL_MASK             (15 << TMR_ENBL_ENBL_SHIFT)
#  define TMR_ENBL_ENBL(n)             ((uint32_t)(n) << TMR_ENBL_ENBL_SHIFT)
#  define TMR_ENBL_CHN0                (1 << TMR_ENBL_ENBL_SHIFT)  /* Channel 0 enable */
#  define TMR_ENBL_CHN1                (2 << TMR_ENBL_ENBL_SHIFT)  /* Channel 1 enable */
#  define TMR_ENBL_CHN3                (4 << TMR_ENBL_ENBL_SHIFT)  /* Channel 2 enable */
#  define TMR_ENBL_CHN4                (8 << TMR_ENBL_ENBL_SHIFT)  /* Channel 3 enable */
                                                  /* Bits: 4-15  Reserved */

#endif /* __ARCH_ARM_SRC_IMXRT_HARDWARE_IMXRT_TMR_H */
